# def score(n):
#     if n in range(90,101):
#         print('优秀')
#     elif n in range(80,90):
#         print('良好')
#     elif n in range(60,80):
#         print('及格')
#     elif n not in range(0,101):
#         print("错误信息，请重新输入")
#     else:
#         print('不及格')
# n = int(input("输入分数"))
# score(n)


# def shui(n):
#     if n <= 3500:
#         y = 0
#     elif 3500 < n <= 5000:
#         y = (n - 3500) * 0.03
#     elif 5000 < n <= 8000:
#         y = 1500 * 0.03 + (n - 5000) * 0.1
#     elif 8000 < n <= 12500:
#         y = 1500 * 0.03 + 3000 * 0.1 + (n - 8000) * 0.2
#     elif 12500 < n <= 38500:
#         y = 1500 * 0.03 + 3000 * 0.1 + 4500 * 0.2 + (n - 12500) * 0.25
#     elif 38500 < n <= 58500:
#         y = 1500 * 0.03 + 3000 * 0.1 + 4500 * \
#             0.2 + 26000 * 0.25 + (n - 38500) * 0.3
#     elif 58500 < n <= 83500:
#         y = 1500 * 0.03 + 3000 * 0.1 + 4500 * 0.2 + \
#             26000 * 0.25 + 20000 * 0.3 + (n - 58500) * 0.35
#     elif n > 83500:
#         y = 1500 * 0.03 + 3000 * 0.1 + 4500 * 0.2 + 26000 * \
#             0.25 + 20000 * 0.3 + 25000 * 0.35 + (n - 83500) * 0.45
#     else:
#         print("请输入正确数值")
        
#     z = n - y

#     print("纳税数额", y, "税后金额", z)

# n = int(input("输入金额"))
# shui(n)


# 练习1:
#   用字符串*运算符，打印三角形
#   　　要求输入一个整数，此整数代表此三角形离左侧的字节数

def triangle(w):
    print('+++++++++++++++++++++++++++++')
    line=1  # 星号个数
    while line <= w:
        # 先算空格的个数
        blanks = w - line
        print(' ' * (blanks+1) + '*' * ((line * 2)-1))
        line += 1
    print('+++++++++++++++++++++++++++++')

w = int(input("输入数字:"))
triangle(w)


# 练习2:
#   输入三行文字，让这三行文字在一个方框内居中显示
#   如输入(不要输入中文)：
#   hello tarena!
#   my name is weimingzi
#   good bye
#   输出：
#   +-----------------------+
#   |     hello tarena      |
#   |  my name is weimingze |
#   |      good bye         |
#   +-----------------------+

